Repository: LakinduVirajith/CalcPal---Mobile-Application
Catalog: lib/l10n/intl_*.arb
Languages: si, ta

# commonMessagesUserInformationError
source: User information not available. Please log in.
ta: பயனர் தகவல் கிடைக்கவில்லை. தயவுசெய்து உள்நுழைக.

# commonMessagesAccessTokenError
source: Access token not available. Please log in.
ta: அணுகல் டோக்கன் கிடைக்கவில்லை. தயவுசெய்து உள்நுழைக.

# commonMessagesIQScoreError
source: User information or IQ score not available. Please log in.
ta: பயனர் தகவல் அல்லது IQ மதிப்பு கிடைக்கவில்லை. தயவுசெய்து உள்நுழைக.

# commonMessagesResultError
source: Unable to fetch diagnosis results. Please log in to your account.
ta: ஆய்வறிக்கையை பெற முடியவில்லை. உங்கள் கணக்கில் உள்நுழைக.

# commonMessagesSomethingWrongError
source: Something went wrong. Please log in to your account.
ta: ஏதோ தவறாகிவிட்டது. உங்கள் கணக்கில் உள்நுழைக.

# commonMessagesLoadQuestion
source: Failed to load question. Please try again.
ta: கேள்வியை ஏற்ற முடியவில்லை. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# commonMessagesLoadActivity
source: Failed to load activity. Please try again.
ta: செயல்பாட்டை ஏற்ற முடியவில்லை. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# commonMessageMainDashboardNavigation
source: Well done! You've completed all the activities successfully today. See you tomorrow!
ta: நன்றாகவே செய்தீர்கள்! இன்று நீங்கள் அனைத்து செயல்பாடுகளையும் வெற்றிகரமாக முடித்துவிட்டீர்கள். நாளைக்கு மீண்டும் சந்திப்போம்!

# commonLexicalMessagesToProceedError
source: To proceed, please allow microphone access.
ta: தொடர, மைக்ரோஃபோனுக்கான அணுகலை அனுமதிக்கவும்.

# commonLexicalMessagesNoSpeechError
source: No speech detected. Let's try that again!
ta: மொழிபெயர்ப்பு கண்டறியப்படவில்லை. மீண்டும் முயற்சிக்கலாம்!

# commonLexicalMessagesFailedToInitializeError
source: Failed to initialize the voice recognition service. Please try again.
ta: குரல் அடையாளம் சேவையை தொடங்க முடியவில்லை. மீண்டும் முயற்சிக்கவும்.

# signupTitle
source: Sign Up
si: ගිණුම සාදාගන්න
ta: பதிவு செய்யவும்

# signupNamePlaceholder
source: Name
si: නම
ta: பெயர்

# signupEmailPlaceholder
source: Email
si: ඊමේල්
ta: மின்னஞ்சல்

# signupBirthdayPlaceholder
source: Birthday
si: උපන් දිනය
ta: பிறந்த நாள்

# signupButton
source: Sign Up
si: ගිණුම සාදන්න
ta: பதிவு செய்யவும்

# signupAlreadyHaveAccount
source: Already have an account?
si: දැනටමත් ගිණුමක් තිබේද?
ta: ஏற்கனவே ஒரு கணக்கு உள்ளதா?

# signupLogin
source: Login
si: ප්‍රවේශය
ta: உள்நுழையவும்

# signupMessagesFillAll
source: Please fill in all fields.
si: සියලු ක්ෂේත්‍ර පිරවීමට අචශය වේ.
ta: அனைத்து புலங்களையும் நிரப்பவும்.

# profileTitle
source: Settings
si: පැතිකඩ
ta: அமைப்புகள்

# profileToggleButton1
source: General
si: සාමාන්‍ය
ta: பொதுவானது

# profileToggleButton2
source: System
si: පද්ධති
ta: கணினி அமைப்பு

# profileUserName
source: User Name:
si: පරිශීලක නාමය:
ta: பயனர் பெயர்:

# profileUserNamePlaceholder
source: Name
si: නාමය
ta: பெயர்

# profileEmail
source: Email:
si: ඊ-මේල්:
ta: மின்னஞ்சல்:

# profileEmailPlaceholder
source: Email
si: ඊ-මේල්
ta: மின்னஞ்சல்

# profileBirthday
source: Birthday:
si: උපන් දිනය:
ta: பிறந்த நாள்:

# profileBirthdayPlaceholder
source: Birthday
si: උපන් දිනය
ta: பிறந்த நாள்

# profileAge
source: Age:
si: වයස:
ta: வயது:

# profileAgePlaceholder
source: Age
si: වයස
ta: வயது

# profileIQScore
source: IQ Score:
si: IQ අගය:
ta: IQ மதிப்பு:

# profileIQScorePlaceholder
source: IQ Score
si: IQ අගය
ta: IQ மதிப்பு

# profileUpdateButtonText
source: Update
si: යාවත්කාලීන කරන්න
ta: புதுப்பிக்கவும்

# profileSelectLanguage
source: Select Language:
si: භාෂාව තෝරන්න:
ta: மொழியை தேர்வு செய்யவும்:

# profileMessagesNotEditableError
source: This field cannot be edited.
si: මෙම ක්ෂේත්‍රය සංස්කරණය කල නොහැක.
ta: இந்த புலம் திருத்த முடியாது.

# profileMessagesUpdateDetailsError1
source: Please enter your username.
si: ඔබගේ පරිශීලක නාමය ලබා දෙන්න.
ta: உங்கள் பயனர் பெயரை உள்ளிடவும்.

# profileMessagesUpdateDetailsError2
source: Please select your birthday.
si: ඔබගේ උපන් දිනය ලබා දෙන්න.
ta: தயவுசெய்து உங்கள் பிறந்தநாளை தேர்வு செய்யவும்.

# mainDashboardConfirmLogout
source: Confirm Logout
si: පිටවීම තහවුරු කරන්න
ta: வெளியேறும் செயல்பாட்டை உறுதிப்படுத்தவும்

# mainDashboardAreYouSure
source: Are you sure you want to log out?
si: ඔබට ඇත්තටම පිටවීමට අවශ්‍යද?
ta: நீங்கள் வெளியேற விரும்புகிறீர்களா?

# mainDashboardCancel
source: Cancel
si: අවලංගු කරන්න
ta: ரத்து செய்யவும்

# mainDashboardLogout
source: Logout
si: පිටවෙන්න
ta: வெளியேறவும்

# activityDashboardActivityText
source: Activities
ta: செயல்பாடுகள்

# iqTestMessagesIQError
source: Unable to update IQ score. Please try again.
ta: IQ மதிப்பை புதுப்பிக்க முடியவில்லை. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# loginTitle
source: Welcome Back!
si: ආපසු සාදරයෙන් පිළිගන්න!
ta: மீண்டும் வரவேற்கிறோம்!

# loginUserName
source: User Name
si: පරිශීලක නාමය
ta: பயனர் பெயர்

# loginPassword
source: Password
si: මුරපදය
ta: கடவுச்சொல்

# loginForgotPassword
source: Forgot Password
si: මුරපදය අමතකද?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா

# loginButton
source: Login
si: ඇතුල් වන්න
ta: உள்நுழையவும்

# loginDontHaveAccount
source: Don't have an account?
si: ගිණුමක් නැද්ද?
ta: கணக்கு இல்லையா?

# loginSignup
source: Sign Up
si: ලියාපදිංචි වන්න
ta: பதிவு செய்யவும்

# loginMessagesFillAll
source: Please fill in all fields.
si: කරුණාකර සියලු ක්ෂේත්‍ර පුරවන්න.
ta: அனைத்து புலங்களையும் நிரப்பவும்.

# forgotPasswordBackButton
source: Back
si: ආපසු
ta: மீண்டும்

# forgotPasswordForgotPasswordButton
source: Forgot Password
si: මුරපදය අමතකද?
ta: கடவுச்சொல்லை மறந்துவிட்டீர்களா

# forgotPasswordInstructionText
source: Enter the email associated with your account and we'll send an email with instructions to rest your password.
si: ඔබගේ ගිණුම සම්බන්ධ වන විද්යුත් තැපැල් ලිපිනය ඇතුල් කරන්න, අපි ඔබගේ මුරපදය නැවත සකසන්න උපදෙස් සමග විද්යුත් තැපෑලක් යවන්නෙමු.
ta: உங்கள் கணக்குடன் தொடர்புடைய மின்னஞ்சலை உள்ளிடவும். உங்கள் கடவுச்சொல்லை மீட்டமைக்கும் வழிமுறைகளுடன் ஒரு மின்னஞ்சலை நாங்கள் அனுப்புவோம்.

# forgotPasswordEmailAddress
source: Email Address
si: විද්යුත් තැපැල් ලිපිනය
ta: மின்னஞ்சல் முகவரி

# forgotPasswordSendInstructionButton
source: Send Instructions
si: උපදෙස් යවන්න
ta: வழிமுறைகளை அனுப்பவும்

# forgotPasswordResendInstructionsButton
source: Resend Instructions
si: උපදෙස් නැවත යවන්න
ta: வழிமுறைகளை மீண்டும் அனுப்பவும்

# forgotPasswordValidateOTPButton
source: Validate OTP
si: OTP වලංගු කරන්න
ta: OTP சரிபார்க்கவும்

# forgotPasswordCreatePasswordButton
source: Create new password
si: නව මුරපදයක් සකසන්න
ta: புதிய கடவுச்சொல்லை உருவாக்கவும்

# forgotPasswordPasswordText
source: Your new password must be different from previous used passwords.
si: ඔබගේ නව මුරපදය පෙර භාවිතා කරන ලද මුරපද වලට වෙනස් විය යුතුය.
ta: உங்கள் புதிய கடவுச்சொல் முந்தைய கடவுச்சொற்களுடன் வேறுபட்டதாக இருக்க வேண்டும்.

# forgotPasswordResetPasswordButton
source: Reset Password
si: මුරපදය නැවත සකසන්න
ta: கடவுச்சொல்லை மீட்டமைக்கவும்

# forgotPasswordMessagesSendInstructionsError1
source: Please provide your email address
si: කරුණාකර ඔබගේ විද්යුත් තැපැල් ලිපිනය ලබා දෙන්න
ta: தயவுசெய்து உங்கள் மின்னஞ்சல் முகவரியை வழங்கவும்

# forgotPasswordMessagesSendInstructionsError2
source: An error occurred while sending OTP
si: OTP යැවීමේදී දෝෂයක් ඇතිවිය
ta: OTP அனுப்புவதில் பிழை ஏற்பட்டது

# forgotPasswordMessagesValidateOTPError1
source: Please fill in all OTP fields
si: කරුණාකර සියලු OTP ක්ෂේත්‍ර පුරවන්න
ta: OTP புலங்களை எல்லாவற்றையும் நிரப்பவும்

# forgotPasswordMessagesValidateOTPError2
source: An error occurred while verifying OTP
si: OTP වලංගු කිරීමේදී දෝෂයක් ඇතිවිය
ta: OTP சரிபார்க்கும்போது பிழை ஏற்பட்டது

# forgotPasswordMessagesResetPasswordError1
source: Don't forget to provide your new password
si: ඔබගේ නව මුරපදය ලබා දීමට අමතක කරන්න එපා
ta: உங்கள் புதிய கடவுச்சொல்லை வழங்க மறக்காதீர்கள்

# forgotPasswordMessagesResetPasswordError2
source: An error occurred while resetting the password
si: මුරපදය නැවත සකස් කිරීමේදී දෝෂයක් ඇතිවිය
ta: கடவுச்சொல்லை மீட்டமைக்கும்போது பிழை ஏற்பட்டது

# diagnoseVerbalMessagesListenAndAnswer
source: Listen and answer the question
si: ශබ්දය අසා ප්‍රශ්නයට පිළිතුරු දෙන්න
ta: கேளுங்கள் மற்றும் கேள்விக்கு பதில் அளியுங்கள்

# diagnoseLexicalMessagesDidntRightError
source: That didn't seem right. Please try saying it again.
si: එය සාර්ථක නොවූ බව පෙනේ. කරුණාකර නැවත පැවසීමේ උත්සාහ කරන්න.
ta: அது சரியில்லை போல தெரியவில்லை. மீண்டும் முயற்சிக்கவும்.

# diagnoseLexicalMessagesReadTheNumber
source: Read the number out loud.
si: සංඛ්‍යාව හඬින් කියවන්න.
ta: இந்த எண்களை ஒலியாகப் படியுங்கள்.

# diagnoseResultElapsedTime
source: Elapsed Time
si: ගතවූ කාලය
ta: நேரம் முறிந்தது

# diagnoseResultTotalScore
source: Total Score
si: මුළු ලකුණු
ta: மொத்த மதிப்பு

# diagnoseResultButton
source: Let's Go
si: එසැණින් යමු
ta: ஆரம்பிக்கவும்

# diagnoseReportMessagesUnexpected
source: An unexpected error occurred. Please try again.
si: අප්‍රතක්ෂාපණ දෝෂයක් සිදු විය. කරුණාකර නැවත උත්සාහ කරන්න.
ta: எதிர்பாராத பிழை ஏற்பட்டது. தயவுசெய்து மீண்டும் முயற்சிக்கவும்.

# diagnoseReportRisk
source: Risk
si: ජීවිතයට අවදානම
ta: அபாயம்

# diagnoseReportSafe
source: Safe
si: ආරක්ෂාකාරී
ta: பாதுகாப்பாக

# diagnoseReportActivityButton
source: Activities
si: ක්‍රියාකාරකම්
ta: செயல்பாடுகள்

# diagnoseReportMainDashboardButton
source: Main Dashboard
si: ප්‍රධාන පුවරුව
ta: முதன்மை டாஷ்போர்ட்

# commonactivityDashboardButtonText
source: Navigate to Dashboard
ta: டாஷ்போர்ட்டுக்கு செல்லவும்

# activityVerbalQuestion1Part1
source: How many
ta: எனக்கு எவ்வளவு

# activityVerbalQuestion1Part2
source: can you count?
ta: எண்ணலாம்?

# activityVerbalQuestion2Text
source: Tap an answer to see if you got it right!
ta: நீங்கள் சரியாகப் பெற்றீர்களா என்பதைப் பார்க்க பதிலைத் தட்டுங்கள்!

# activityLexicalMessageWrongAnswer
source: Close! Let's try again and see if we can find the right answer!
ta: அருகில்! மீண்டும் முயற்சிக்கிறோம் மற்றும் சரியான பதிலை கண்டுபிடிக்க முயற்சிக்கலாம்!

# activityLexicalMessageCorrectAnswer
source: Awesome! That's the correct answer! Let’s tackle the next challenge!
ta: அற்புதம்! அது சரியான பதில்! அடுத்த சவாலுக்கு தயாராகலாம்!

# activityLexicalQuestion1Text
source: Drop your answer here!
ta: உங்கள் பதிலை இங்கே விடவும்!

# activityLexicalQuestion2Text
source: Read this number aloud
ta: இந்த எண்ணை ஒலியாகப் படியுங்கள்

# commonServiceResponseError
source: An unexpected error occurred. Please try again later.
si: අපේක්ෂිත නොවන දෝෂයක් සිදු විය. කරුණාකර පැයකින් නැවත උත්සාහ කරන්න.
ta: எதிர்பாராத பிழை ஏற்பட்டது. சில நேரங்கள் பிறகு மீண்டும் முயற்சிக்கவும்.

# commonServiceNetworkError
source: Network error occurred. Please check your connection.
si: ජාල ගැටලුවක් ඇතිවිය. කරුණාකර ඔබේ සම්බන්ධතාවය පරික්ෂා කරන්න.
ta: நெட்வொர்க் பிழை ஏற்பட்டது. உங்கள் இணைப்பைச் சரிபார்க்கவும்.

# commonServiceOtherError
source: An unexpected error occurred
si: අපේක්ෂිත නොවන දෝෂයක් සිදු විය.
ta: எதிர்பாராத பிழை ஏற்பட்டது

# commonMessageNoQuestionError
source: No questions found on the server for the provided question number.
ta: முடுக்கான கேள்வி எண் தரவுத்தொகுப்பில் எதேனும் கேள்விகள் கிடைக்கவில்லை.

# userServiceSignup200
source: Sign-up successful! Please check your email to verify your account before logging in.
si: ලියාපදිංචිය සාර්ථකයි! පිවිසීමට පෙර කරුණාකර ඔබේ ගිණුම සත්‍යාපනය කිරීමට ඔබේ විද්‍යුත් තැපැල් පරීක්ෂා කරන්න.
ta: சைய்ண்-அப் வெற்றிகரமாக உள்ளது! உள்நுழையும்முன் உங்கள் கணக்கை சரிபார்க்க உங்கள் மின்னஞ்சலைப் பார்க்கவும்.

# userServiceSignup403
source: Invalid email address. Please provide a valid email to proceed.
si: අනීතික විද්‍යුත් තැපැල් ලිපිනයකි. කරුණාකර ඉදිරියට යාමට වලංගු විද්‍යුත් තැපැල් ලිපිනයක් ලබා දෙන්න.
ta: தரப்படும் மின்னஞ்சல் முகவரி தவறானது. தொடருவதற்கு சரியான மின்னஞ்சலை வழங்கவும்.

# userServiceSignup409
source: Email already in use. Please log in or use a different email.
si: විද්‍යුත් තැපෑල දැනටමත් භාවිතා වන අතර. කරුණාකර ප්‍රවේශ වන්න හෝ වෙනත් විද්‍යුත් තැපැල් ලිපිනයක් භාවිතා කරන්න.
ta: மின்னஞ்சல் ஏற்கனவே பயன்படுத்தப்படுகிறது. உள்நுழையவும் அல்லது வேறு மின்னஞ்சலைப் பயன்படுத்தவும்.

# userServiceSignup500
source: Error sending activation email. Please try again later.
si: සක්‍රිය කිරීමේ විද්‍යුත් තැපෑල යැවීමේ දෝෂයක්. කරුණාකර පැයකින් නැවත උත්සාහ කරන්න.
ta: செயலாக்க மின்னஞ்சல் அனுப்புவதில் பிழை ஏற்பட்டது. சில நேரங்கள் பிறகு மீண்டும் முயற்சிக்கவும்.

# userServiceLogin200
source: Login successful! Welcome back.
si: පිවිසුම සාර්ථකයි! නැවත පිළිගනිමු.
ta: உள்நுழைவு வெற்றிகரமாக உள்ளது! திரும்ப வருக.

# userServiceLogin401
source: Incorrect password. Please check and try again.
si: අසත්‍ය මුරපදයයි. කරුණාකර පරීක්ෂාකර නැවත උත්සාහ කරන්න.
ta: தவறான கடவுச்சொல். தயவுசெய்து சரிபார்த்து மீண்டும் முயற்சிக்கவும்.

# userServiceLogin403
source: Your account is not activated. Please check your email and verify your account.
si: ඔබේ ගිණුම සක්‍රීය කර නැත. කරුණාකර ඔබේ විද්‍යුත් තැපෑල පරීක්ෂාකර ගිණුම සත්‍යාපනය කරන්න.
ta: உங்கள் கணக்கு செயலாக்கப்படவில்லை. உங்கள் மின்னஞ்சலைப் சரிபார்க்கவும் மற்றும் உங்கள் கணக்கைச் சரிபார்க்கவும்.

# userServiceLogin404
source: No user found with the provided email address.
si: එක්කල විද්‍යුත් තැපැල් ලිපිනය සමඟ ගිණුමක් සොයා ගත නොහැක.
ta: தரப்பட்ட மின்னஞ்சல் முகவரியுடன் பயனர் கிடைக்கவில்லை.

# userServiceLogin500
source: Error sending activation email. Please try again later.
si: සක්‍රීය කිරීමේ විද්‍යුත් තැපෑල යැවීමේ දෝෂයක්. කරුණාකර පැයකින් නැවත උත්සාහ කරන්න.
ta: செயலாக்க மின்னஞ்சல் அனுப்புவதில் பிழை ஏற்பட்டது. சில நேரங்கள் பிறகு மீண்டும் முயற்சிக்கவும்.

# userServiceGenerateNewToken200
source: Authentication successful. New tokens have been issued.
si: සත්‍යාපනය සාර්ථකයි. නව ටෝකන නිකුත් කර ඇත.
ta: அங்கீகாரம் வெற்றிகரமாக உள்ளது. புதிய டோக்குகள் வழங்கப்பட்டுள்ளன.

# userServiceGenerateNewToken400
source: Refresh token is invalid or expired. Please log in again.
si: නැවත සත්‍යාපන ටෝකනය වලංගු නොවේ හෝ කල් ඉකුත් වී ඇත. කරුණාකර නැවත පිවිසෙන්න.
ta: ரிபிரஷ் டோக்கு தவறாக அல்லது காலாவதியானது. மீண்டும் உள்நுழையவும்.

# userServiceGenerateNewToken403
source: Your account is not activated. Please activate your account to proceed.
si: ඔබගේ ගිණුම සක්‍රීය කර නැත. ඉදිරියට යාමට කරුණාකර ඔබේ ගිණුම සක්‍රීය කරන්න.
ta: உங்கள் கணக்கு செயலாக்கப்படவில்லை. தொடர்வதற்கு உங்கள் கணக்கை செயலாக்கவும்.

# userServiceGenerateNewToken404
source: User account not found. Please check your email or register a new account.
si: පරිශීලක ගිණුම සොයා ගත නොහැක. කරුණාකර ඔබේ විද්‍යුත් තැපෑල පරීක්ෂා කරන්න හෝ නව ගිණුමක් ලියාපදිංචි කරන්න.
ta: பயனர் கணக்கு கிடைக்கவில்லை. உங்கள் மின்னஞ்சலைச் சரிபார்க்கவும் அல்லது புதிய கணக்கை பதிவு செய்யவும்.

# userServiceLogout200
source: You've been successfully logged out. See you next time!
si: ඔබ සාර්ථකව නික්මගොස් ඇත. නැවත හමුවෙමු!
ta: நீங்கள் வெற்றிகரமாக உள்நுழைந்துள்ளீர்கள். அடுத்த முறையில் சந்திப்போம்!

# userServiceLogout400
source: Invalid logout request
si: අනීතික නික්මීමේ ඉල්ලීමක්
ta: தவறான உள்நுழைவு கோரிக்கை

# userServiceSendOTP200
source: A password reset email has been sent. Please check your inbox for further instructions.
si: මුරපදය නැවත පිහිටුවීමේ විද්‍යුත් තැපෑලක් යවා ඇත. කරුණාකර ඔබේ තැපැල් පෙට්ටිය පරීක්ෂාකර වැඩිදුර උපදෙස් සඳහා.
ta: கடவுச்சொல் மீட்டமைப்பு மின்னஞ்சல் அனுப்பப்பட்டுள்ளது. மேலதிக வழிகாட்டிகளைப் பெற உங்கள் மின்னஞ்சலைச் சரிபார்க்கவும்.

# userServiceSendOTP404
source: No account found with the provided email.
si: එක්කල විද්‍යුත් තැපැල් ලිපිනය සමඟ ගිණුමක් සොයා ගත නොහැක.
ta: தரப்பட்ட மின்னஞ்சல் முகவரியுடன் கணக்கு கிடைக்கவில்லை.

# userServiceSendOTP500
source: An error occurred while sending the reset email. Please try again.
si: මුරපදය නැවත පිහිටුවීමේ විද්‍යුත් තැපෑල යැවීමේදී දෝෂයක් සිදු විය. කරුණාකර පැයකින් නැවත උත්සාහ කරන්න.
ta: மீட்டமைப்பு மின்னஞ்சல் அனுப்புவதில் பிழை ஏற்பட்டது. மீண்டும் முயற்சிக்கவும்.

# userServiceValidateOTP200
source: OTP validated successfully.
si: OTP සාර්ථකව සත්‍යාපනය කරන ලදි.
ta: OTP வெற்றிகரமாகச் சரிபார்க்கப்பட்டது.

# userServiceValidateOTP400
source: The OTP provided is incorrect. Please try again.
si: එක්කල OTP අපහසුයි. කරුණාකර නැවත උත්සාහ කරන්න.
ta: OTT வழங்கப்பட்டது தவறானது. மீண்டும் முயற்சிக்கவும்.

# userServiceValidateOTP404
source: No account found with the provided email.
si: එක්කල විද්‍යුත් තැපැල් ලිපිනය සමඟ ගිණුමක් සොයා ගත නොහැක.
ta: தரப்பட்ட மின்னஞ்சல் முகவரியுடன் கணக்கு கிடைக்கவில்லை.

# userServiceValidateOTP410
source: The OTP has expired. Please request a new one.
si: OTP කල් ඉකුත් වී ඇත. කරුණාකර නව OTP ඉල්ලාසිටවන්න.
ta: OTP காலாவதியானது. புதிய ஒன்றை கோரிக்கையிடவும்.

# userServiceResetPassword200
source: Your password has been reset successfully.
si: ඔබගේ මුරපදය සාර්ථකව නැවත පිහිටුවා ඇත.
ta: உங்கள் கடவுச்சொல் வெற்றிகரமாக மீட்டமைக்கப்பட்டுள்ளது.

# userServiceResetPassword404
source: No account found with the provided email.
si: එක්කල විද්‍යුත් තැපැල් ලිපිනය සමඟ ගිණුමක් සොයා ගත නොහැක.
ta: தரப்பட்ட மின்னஞ்சல் முகவரியுடன் கணக்கு கிடைக்கவில்லை.

# userServiceUpdateUser200
source: Your details have been updated successfully.
si: ඔබගේ විස්තර සාර්ථකව යාවත්කාලීන කරන ලදි.
ta: உங்கள் விவரங்கள் வெற்றிகரமாக புதுப்பிக்கப்பட்டுள்ளது.

# userServiceUpdateUser404
source: User account not found. Please make sure you are logged in.
si: පරිශීලක ගිණුම සොයා ගත නොහැක. කරුණාකර ඔබ පිවිසි ඇත්තේදැයි පරික්ෂාකරන්න.
ta: பயனர் கணக்கு கிடைக்கவில்லை. உள்நுழைந்துள்ளீர்களா என்பதைக் சரிபார்க்கவும்.

# userServiceUpdateIQ200
source: Success! Your IQ score is now up to date.
ta: வெற்றி! உங்கள் IQ மதிப்பு இப்போது புதுப்பிக்கப்பட்டுள்ளது.

# sequentialQuestion
source: Select The Next Pattern
ta: அடுத்த வடிவத்தைத் தேர்ந்தெடுக்கவும்

# operationalQuestion
source: Select the correct answer -
ta: Sசரியான பதிலைத் தேர்ந்தெடுக்கவும் -

# ideognosticQuestionType1
source: Select the fraction showed by the image
ta: படத்தில் காட்டப்பட்டுள்ள பகுதியைத் தேர்ந்தெடுக்கவும்

# ideognosticQuestionType2_largest
source: Using these digits, make the largest number possible
ta: மிகப்பெரிய எண்ணை சாத்தியமாக்குங்கள்

# ideognosticQuestionType2_smallest
source: Using these digits, make the smallest number possible
ta: மிகச் சிறிய எண்ணை சாத்தியமாக்குங்கள்

# ideognosticQuestionType3
source: Write the fraction showed by the image (WITHOUT simplifying)
ta: படத்தில் காட்டப்படும் பகுதியை எழுதவும் (எளிமைப்படுத்தாமல்)

# nextBtnText
source: Next
ta: அடுத்தது

# opActivityLvl1Add
source: Let's Add!
ta: சேர்ப்போம்!

# opActivityLvl1Sub
source: Let's Subtract!
ta: கழிப்போம்!

# opActivityLvl1Mul
source: Let's Multiply!
ta: பெருக்குவோம்!

# opActivityLvl1Div
source: Let's Divide!
ta: பிரிப்போம்!

# correctText
source: Correct!
ta: சரி!

# tryAgainText
source: Try Again!
ta: மீண்டும் முயற்சிக்கவும்!

# level1GeneralLbl
source: Level 1 - General
ta: நிலை 1 - பொது

# level1AdditionLbl
source: Level 1 - Addition
ta: நிலை 1 - கூட்டல்

# level1SubtractionLbl
source: Level 1 - Subtraction
ta: நிலை 1 - கழித்தல்

# level1MultiplicationLbl
source: Level 1 - Multiplication
ta: நிலை 1 - பெருக்கல்

# level1DivisionLbl
source: Level 1 - Division
ta: நிலை 1 - வகுத்தல்

# level2AdditionLbl
source: Level 2 - Addition
ta: நிலை 2 - கூட்டல்

# level2SubtractionLbl
source: Level 2 - Subtraction
ta: நிலை 2 - கழித்தல்

# level2MultiplicationLbl
source: Level 2 - Multiplication
ta: நிலை 2 - பெருக்கல்

# level2DivisionLbl
source: Level 2 - Division
ta: நிலை 2 - வகுத்தல்

# level1NumberLinesLbl
source: Level 1 - Number Lines
ta: நிலை 1 - எண் வரிகள்

# level2FractionsLbl
source: Level 2 - Fractions
ta: நிலை 2 - дробங்கள்

# level2NumberCreationLbl
source: Level 2 - Number Creation
ta: நிலை 2 - எண் உருவாக்கம்

# numberLineTopic
source: Label the Number Line
ta: எண் வரியை குறிக்க

# checkAnsBtn
source: Check Answer
ta: பதில் சரிபார்க்கவும்

# largest2DigitNumber
source: Create the Largest 2-Digit Number
ta: 2 இலக்கத்தின் மிகப்பெரிய எண்ணை உருவாக்குங்கள்

# smallest2DigitNumber
source: Create the Smallest 2-Digit Number
ta: 2 இலக்கத்தின் மிகச்சிறிய எண்ணை உருவாக்குங்கள்

# largest3DigitNumber
source: Create the Largest 3-Digit Number
ta: 3 இலக்கத்தின் மிகப்பெரிய எண்ணை உருவாக்குங்கள்

# largest4DigitNumber
source: Create the Largest 4-Digit Number
ta: 4 இலக்கத்தின் மிகப்பெரிய எண்ணை உருவாக்குங்கள்

# numeratorDesc
source: Did you know 😲? You can find the numerator by counting the no of shaded parts.
ta: நீங்கள் அறிவீர்களா 😲? நிழலிட்ட பகுதிகளின் எண்ணிக்கையை எண்ணுவதன் மூலம் குறூப்பியை கண்டுபிடிக்கலாம்.

# denominatorDesc
source: Did you know 😲? You can find the denominator by counting the total no of parts.
ta: நீங்கள் அறிவீர்களா 😲? மொத்த பகுதிகளின் எண்ணிக்கையை எண்ணுவதன் மூலம் பகாத்தியை கண்டுபிடிக்கலாம்.

# typeFractionLbl
source: Type the Fraction below
ta: கீழே கூறுபிரிப்பு எண்களை டைப் செய்யவும்

# onesLbl
source: Ones
ta: ஒன்றுகள்

# tensLbl
source: Tens
ta: பத்துகள்

# hundredsLbl
source: Hundreds
ta: நூறுகள்

# enterAnswerPlaceholder
source: Enter your answer
ta: உங்கள் பதிலை உள்ளிடவும்

# multiLvl2Num1Text
source: Any number multiplied by 1 gives the same number
ta: ஒரு எண்ணை 1-ல் பெருக்கினால், அது அதே எண் கிடைக்கும்

# multiLvl2Num2Text
source: Any number multiplied by 2 means, adding the number twice
ta: ஒரு எண்ணை 2-ல் பெருக்குவது அந்த எண்ணை இரண்டுமுறை சேர்த்தல்

# multiLvl2Num5Text
source: To multiply by 5, recall the 5 times table
ta: 5-ல் பெருக்க, 5 மடங்குப் பட்டியலை நினைவுபடுத்துங்கள்

# multiLvl2Num10Text
source: When multiplied by 10, an new zero is added to the number
ta: ஒரு எண்ணை 10-ல் பெருக்கினால், எண்ணிற்கு புதிதாக 0 ஒன்று சேர்க்கப்படும்

# divLvl2Num1Text
source: Tip! Any number divided by 1 is the number itself.
ta: செய்தி! 1-ல் வகுத்தால், அதே எண் கிடைக்கும்.

# divLvl2Num2Text
source: Tip! Even numbers are divisible by 2.
ta: செய்தி! சீரெழுத்துக் கணக்குகள் 2-ல் வகுக்கலாம்.

# divLvl2Num3Text
source: Tip! A number is divisible by 3 if its digits sum is a multiple of 3
ta: செய்தி! எண் ஒன்றின் இலக்கங்கள் கூட்டம் 3 ஆகவோ 3 மடங்காகவோ இருந்தால், அது 3-ல் வகுக்கலாம்.

# divLvl2Num10Text
source: Tip! Multiples of 10 are easy to divide by 10.
ta: செய்தி! 10 மடங்குகள் எளிதாக 10-ல் வகுக்கலாம்.

# progressStoredTxt
source: Progress saved successfully
ta: முன்னேற்றம் வெற்றிகரமாக சேமிக்கப்பட்ட

# activityReportsTitle
source: Activity Reports
ta: செயல்பாடுகள் அறிக்கைகள்

source: Select Activity
ta: செயல்பாட்டை தேர்ந்தெடுக்கவும்

source: No activity selected
ta: செயல்பாடு தேர்வு செய்யப்படவில்லை

# noResultsFound
source: No results found for the selected activity.
ta: தேர்ந்தெடுக்கப்பட்ட செயலுக்கான எந்த முடிவுகளும் கிடைக்கவில்லை.

source: Date Played
ta: விளையாடிய தேதி

source: Score
ta: மதிப்பெண்

source: Correct Number
ta: சரியான எண்

source: Time Played (in secs)
ta: விளையாடிய நேரம் (விநாடிகளில்)

# correctToast
source: 🎉 Correct! 🎉
ta: சரியாக உள்ளது! 🎉

# tryAgainToast
source: Try Again!
ta: மீண்டும் முயற்சிக்கவும்!

# nextExcerciseToast
source: Not quite right, let's try the next exercise
ta: அது நெருங்கியது. அடுத்த பயிற்சியை தொடங்கலாம்.

# correctAns
source: Correct Answer
ta: சரியான பதில்

# showCongratulatoryDialogTitle
source: Congratulations!
ta: அன்பு வாழ்த்துக்கள்!

# showCongratulatoryDialogContent
source: You answered correctly!
ta: நீங்கள் சரியாக பதிலளித்தீர்கள்!

# showCongratulatoryDialogButton
source: Next
ta: அடுத்தது
